1. Drop Columns
2. Imputation

The said columns are dropped simply on the basis of their observed relationship in Tableau.
Amenities Attribute could've been simplified but is left as it is for now.

In [45]:
import numpy as np
import pandas as pd

In [46]:
train = pd.read_csv('..\\0.data\\titanic-train.csv')
test = pd.read_csv('..\\0.data\\titanic-test.csv')
print(train.shape)
print(test.shape)
train.head()

# SibSpNumber of siblings/spouses aboard the Titanic
# ParchNumber of parents/children aboard the Titanic
# CabinCabin number
# EmbarkedWhere the passenger got on the ship (C - Cherbourg, S - Southampton, Q = Queenstown)

(891, 12)
(418, 11)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [47]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Mellors, Mr. William John",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

### 1. Drop Columns

In [48]:
print(train.columns)
test.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [49]:
columnsToBeDropped = ['Name', 'Ticket']
train.drop(columnsToBeDropped, axis=1, inplace=True)
test.drop(columnsToBeDropped, axis=1, inplace=True)
train.shape

(891, 10)

### 2. Imputation Data

In [50]:
print(train.isnull().sum())
test.isnull().sum()
test.shape

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Cabin          687
Embarked         2
dtype: int64

(418, 9)

## Imputing Age, Embarked, Cabin

In [51]:
train.drop(['Cabin'], axis=1, inplace=True)
test.drop(['Cabin'], axis=1, inplace=True)

print(train.isnull().sum())
test.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             0
Embarked         2
dtype: int64

PassengerId     0
Pclass          0
Sex             0
Age            86
SibSp           0
Parch           0
Fare            1
Embarked        0
dtype: int64

In [52]:
train['Age'] = train['Age'].apply(lambda x: -1 if x != x else x)
test['Age'] = test['Age'].apply(lambda x: -1 if x != x else x)

In [53]:
print(train.isnull().sum())
test.isnull().sum()
# test.shape

PassengerId    0
Survived       0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           0
Embarked       2
dtype: int64

PassengerId    0
Pclass         0
Sex            0
Age            0
SibSp          0
Parch          0
Fare           1
Embarked       0
dtype: int64

In [54]:
print(train.shape)
test.shape

(891, 9)

(418, 8)

In [55]:
'''
For the remaining Nan's, the rows are simple dropped. i.e for Embarked and Fare
'''
train = train.dropna(axis=0)
test['Fare'] = test['Fare'].apply(lambda x: -1 if x != x else x)

print(train.shape)
test.shape

(889, 9)

(418, 8)

In [56]:
train.nunique()

PassengerId    889
Survived         2
Pclass           3
Sex              2
Age             89
SibSp            7
Parch            7
Fare           247
Embarked         3
dtype: int64

In [57]:
train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Sex             object
Age            float64
SibSp            int64
Parch            int64
Fare           float64
Embarked        object
dtype: object

## Conversion of objects to numerical values

In [58]:
categoryColumns = ["Sex", "Embarked"]
# numericalColumns = ['Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare']

train[categoryColumns] = train[categoryColumns].apply(lambda x: x.astype('category'))
# train[numericalColumns] = train[numericalColumns].apply(lambda x: x.astype('float'))

test[categoryColumns] = test[categoryColumns].apply(lambda x: x.astype('category'))
# test[numericalColumns] = test[numericalColumns].apply(lambda x: x.astype('float'))
test.dtypes

PassengerId       int64
Pclass            int64
Sex            category
Age             float64
SibSp             int64
Parch             int64
Fare            float64
Embarked       category
dtype: object

In [59]:
train = pd.get_dummies(train, columns=categoryColumns)
test = pd.get_dummies(test, columns=categoryColumns)

train

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,22.0,1,0,7.2500,0,1,0,0,1
1,2,1,1,38.0,1,0,71.2833,1,0,1,0,0
2,3,1,3,26.0,0,0,7.9250,1,0,0,0,1
3,4,1,1,35.0,1,0,53.1000,1,0,0,0,1
4,5,0,3,35.0,0,0,8.0500,0,1,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,27.0,0,0,13.0000,0,1,0,0,1
887,888,1,1,19.0,0,0,30.0000,1,0,0,0,1
888,889,0,3,-1.0,1,2,23.4500,1,0,0,0,1
889,890,1,1,26.0,0,0,30.0000,0,1,1,0,0
890,891,0,3,32.0,0,0,7.7500,0,1,0,1,0

In [60]:
print(train.shape)
test.shape

(889, 12)

(418, 11)

In [61]:
train.to_csv('..\\0.data\\trainV1.csv', index=False, header=True)
test.to_csv('..\\0.data\\testV1.csv', index=False, header=True)

In [62]:
test.isnull().sum()

PassengerId    0
Pclass         0
Age            0
SibSp          0
Parch          0
Fare           0
Sex_female     0
Sex_male       0
Embarked_C     0
Embarked_Q     0
Embarked_S     0
dtype: int64